** Modeline
#+begin_src elisp
  (use-package nerd-icons
    :ensure t)
#+end_src

#+begin_src elisp
  (use-package doom-modeline
    :ensure t
    :config
    (setq doom-modeline-minor-modes nil)
    :hook
    (lsp-mode . (lambda () (setq-local doom-modeline-buffer-name nil)))
    :init (doom-modeline-mode 1))
#+end_src

#+RESULTS:
| #[nil ((setq-local doom-modeline-buffer-name nil)) nil] | dap-tooltip-update-mouse-motions-if-enabled |

** Emacs customization
Make a keymap for =project.el= 
#+begin_src elisp
  (setq my/project-map (make-sparse-keymap))
  (define-key global-map (kbd "C-c p") `("project" . ,my/project-map))
#+end_src

#+RESULTS:
| project | keymap |

Function to kill backwards to the first character
#+begin_src elisp
  (defun backward-kill-line ()
    (interactive)
    (set-mark-command nil)
    (back-to-indentation)
    (kill-region (region-beginning) (region-end)))
#+end_src

#+begin_src elisp
  (use-package emacs
    :custom
    (tab-always-indent 'complete)
    ;; Emacs 28 and newer: Hide commands in M-x which do not apply to the current
    ;; mode.  Corfu commands are hidden, since they are not used via M-x. This
    ;; setting is useful beyond Corfu.
    (read-extended-command-predicate #'command-completion-default-include-p)
    (enable-recursive-minibuffers t)
    ;; more comfort
    (line-spacing 3)
    (scroll-conservatively 101)
    ;; use a very narrow window divider
    (window-divider-default-right-width 1)
    (window-divider-default-bottom-width 1)
    (scroll-bar-mode nil)
    (xref-prompt-for-identifier nil)
    (desktop-save-mode t)
    (cursor-style 'bar)
    ;; don't show cursors in non-active windows
    (cursor-in-non-selected-windows nil)
    :config 
    (electric-pair-mode 1)    
    (menu-bar-mode -1) ;; It doesn't help me at all
    ;; wrap on whitespace
    (global-word-wrap-whitespace-mode 1)
    (auto-save-mode -1) ; turn off autosave
    (setq auto-save-timeout 3)
    (setq ediff-window-setup-function #'ediff-setup-windows-plain)
    (menu-bar-bottom-and-right-window-divider)
    (scroll-bar-mode -1)
    ;; font installed from https://www.jetbrains.com/lp/mono/
    (add-to-list 'default-frame-alist '(font . "DroidSansM Nerd Font"))
    :bind
    ("C-<return>" . recenter)
    ("M-<backspace>" . backward-kill-word)
    ("C-M-RET" . xref-find-references)
    ("s-K" . kill-buffer-and-window)
    ("C-M-." . xref-find-definitions-other-window)
    ("C-q" . bury-buffer)
    ("s-<backspace>" . backward-kill-line)
  ("C-M-z" . zap-up-to-char)
  :init
    (defun crm-indicator (args)
      (cons (format "[CRM%s] %s"
              (replace-regexp-in-string
               "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
               crm-separator)
              (car args))
      (cdr args)))
    (advice-add #'completing-read-multiple :filter-args #'crm-indicator))
#+end_src

#+RESULTS:
: zap-up-to-char

#+begin_src elisp
  (use-package kmacro
    :config
    (defalias 'kmacro-insert-macro 'insert-kbd-macro)
    (define-key kmacro-keymap (kbd "I") #'kmacro-insert-macro))
#+end_src

* yas
Create a yas keymap
#+begin_src elisp
  (setq my/yas-map (make-sparse-keymap))
  (define-key global-map (kbd "C-c C-y") `("yas" . ,my/yas-map))
  #+end_src

  #+RESULTS:
  | yas | keymap |

#+begin_src elisp
  (use-package yasnippet
    :ensure t
    :bind
    (:map my/yas-map
  	  ("n" . yas-new-snippet)
  	  ("s" . yas-insert-snippet))
    :config (yas-global-mode 1))
#+end_src

#+RESULTS:
: yas-insert-snippet

*** Company
#+begin_src elisp
  (use-package company
    :disabled t
    :ensure t
    :config
    (setq company-tooltip-align-annotations t
  		 ;;         company-show-quick-access t
          company-files-exclusions '(".git/" ".DS_Store")
          ;; use letters instead of icons
          company-format-margin-function #'company-text-icons-margin
          company-text-icons-add-background t
          ;; make it so that I do it myself, please
          company-idle-delay 0.3)
    ;; customize the annotation faces
    ;; (custom-set-faces
    ;;  '(company-tooltip-annotation ((t (:foreground "dark gray")))))
    ;; (
     (setq company-backends '((:separate company-yasnippet company-capf company-keywords)))
    :bind
    ("M-i" . company-manual-begin)
    (:map company-active-map
          ([tab] . company-complete-common-or-cycle)
          ("<escape>" . company-abort))
    :init
    (global-company-mode 1))
#+end_src

#+RESULTS:
: company-abort

Company-box shows nice popups (and documentation) for selection candidates
#+begin_src elisp
  (use-package company-box
    :disabled t
    :ensure t
    :requires company
    :config
    (setq company-box-doc-delay 0.8)
    :hook (company-mode . company-box-mode))
#+end_src

Really turn off company mode
#+begin_src elisp
  ;; (defun turn-off-company ()
  ;;   (company-mode -1))
  ;;   (add-hook 'prog-mode-hook #'turn-off-company)
#+end_src


#+RESULTS:
| turn-off-company | hl-todo-mode | rainbow-delimiters-mode | highlight-indent-guides-mode | hl-line-mode | display-line-numbers-mode |


*** node
Need the node setup
#+begin_src elisp
          (use-package dap-node
            :requires dap-mode
            :after dap-mode
    	:config
  	(dap-node-setup))
#+end_src

Use the chrome setup too, since the chrome debugger is nice
#+begin_src elisp
    (use-package dap-chrome
      :requires dap-mode
      :after dap-mode
      :config
      (dap-chrome-setup))
#+end_src


A configuration to run the tests with debug enabled
#+begin_src elisp
  (dap-register-debug-template
   "debug tests"
   (list :type "node"
         :request "launch"
         :args  '("--inspect-brk" "/opt/homebrew/bin/jest" "--runInBand")
         :name "Debug tests"))
#+end_src

A configuration to simply run a file
#+begin_src elisp
  (dap-register-debug-template
   "Node run file"
   (list :type "node"
   :request "launch"
   :program "${workspaceFolder}/local/run-query.ts"
   :args nil
   :name "node run"))
#+end_src

TS-node config, for changing on the fly
#+begin_src elisp
  ;; TODO: make this an interactive function to run the debug configuration
   (dap-register-debug-template
    "TS run"
  (list :name "TS Index"
        :type "node"
        :request "launch"
        :args (expand-file-name "~/j1/query-domain/local/run-query.ts")
        :runtimeArgs ["--nolazy" "-r" "ts-node/register"]
        :sourceMaps t
        :cwd (expand-file-name "~/j1/query-domain")
        :protocol "inspector"))
#+end_src



#+RESULTS:
| TS run                 | :name | TS Index | :type    | node   | :request | launch                                             | :args    | /Users/jonlasley/j1/query-domain/local/run-query.ts | :runtimeArgs | [--nolazy -r ts-node/register] | :sourceMaps | t | :cwd | /Users/jonlasley/j1/query-domain | :protocol | inspector |
| Node::Run              | :type | node     | :cwd     | nil    | :request | launch                                             | :program | /Users/jonlasley/j1/query-domain/local/run-query.ts | :name        | Node::Run                      |             |   |      |                                  |           |           |
| Node run file          | :type | node     | :request | launch | :program | ${workspaceFolder}/local/run-query.ts              | :args    | nil                                                 | :name        | node run                       |             |   |      |                                  |           |           |
| debug tests            | :type | node     | :request | launch | :args    | (--inspect-brk /opt/homebrew/bin/jest --runInBand) | :name    | Debug tests                                         |              |                                |             |   |      |                                  |           |           |
| Node Run Configuration | :type | node     | :cwd     | nil    | :request | launch                                             | :program | nil                                                 | :name        | Node::Run                      |             |   |      |                                  |           |           |


** lsp
Format and organize before saving

#+begin_src elisp
  (defun lsp-format-and-organize-imports ()
    (add-hook 'before-save-hook #'lsp-format-buffer t t)
    (add-hook 'before-save-hook #'lsp-organize-imports t t))
#+end_src

Don't watch vendor dirs
#+begin_src elisp
    (defun lsp-ignore-vendor ()
      (add-to-list lsp-file-watch-ignored-directories "[/\\\\]vendor"))
#+end_src


#+begin_src elisp
  (use-package lsp-mode
    :ensure t
    :config
    (setq lsp-headerline-breadcrumb-enable t
          lsp-enable-file-watchers nil
          ;; show warns in flycheck
          lsp-diagnostics-flycheck-default-level 'warning)
    (add-to-list 'lsp-file-watch-ignored-files "[/\\\\].*~$")
    :hook
    ;; go
    ((go-mode . lsp-deferred)
     (go-mode . lsp-format-and-organize-imports)
     ;; (go-mode . lsp-ignore-vendor)
     (tsx-ts-mode . lsp-deferred)
     (rust-mode . lsp-deferred)
     (go-mode . lsp-format-and-organize-imports)))
#+end_src

#+RESULTS:
| go-guru-hl-identifier-mode | #[nil ((flycheck-golangci-lint-setup) (setq flycheck-local-checkers '((lsp (next-checkers golangci-lint))))) nil] | flycheck-golangci-lint-setup | lsp-format-and-organize-imports | lsp-deferred | doom-modeline-env-setup-go |

** JavaScript

#+begin_src elisp
  (add-to-list 'auto-mode-alist '("\\.[jt]sx?" . tsx-ts-mode)) ; going to try out webmode for a little, think it will be nice
    (add-hook 'tsx-ts-mode-hook #'lsp-deferred)
#+end_src

add the same hooks for typescript-ts-mode
#+begin_src elisp
  (add-hook 'typescript-ts-mode-hook #'lsp-deferred)
#+end_src


#+RESULTS:
| lsp-deferred |

[[https://web-mode.org/][Web mode]] is sick
#+begin_src elisp
  (use-package web-mode
    :ensure t
    :disabled t
    :hook
    (web-mode . lsp-deferred)
    (web-mode . lsp-format-and-organize-imports)
    :config
    (add-to-list 'auto-mode-alist '("\\.[tj]sx" . web-mode)))
#+end_src

*** Prettier

#+begin_src elisp
  (use-package prettier
    :ensure t
    :defer t
    :hook
    (web-mode . prettier-mode)
    (tsx-ts-mode . prettier-mode)
    (typescript-ts-mode . prettier-mode))
#+end_src

#+RESULTS:
| prettier-mode | lsp-deferred |

*** PKL
[[https://github.com/sin-ack/pkl-mode][Reference]]
#+begin_src elisp
  ;; requires a custom language server
  (with-eval-after-load 'lsp-mode
    (add-to-list 'lsp-language-id-configuration '(pkl-mode . "pkl"))

    ;; add the server
    (lsp-register-client (make-lsp-client
            :new-connection (lsp-stdio-connection '("java" "-jar" "/Users/LASLEJX1/.pkl/lsp.jar"))
            :activation-fn (lsp-activate-on "pkl")
            :server-id 'pkl)))



  ;; (use-package pkl-mode
  ;;   :vc (:url "https://github.com/sin-ack/pkl-mode" :rev :newest)
  ;;   :hook
  ;;   (pkl-mode . lsp-deferred))
#+end_src

#+RESULTS:
| lsp-deferred |

LSP configuration
#+begin_src elisp
#+end_src

#+RESULTS:



** Super agenda
#+begin_src elisp
  (use-package org-super-agenda
    :ensure t
    :init (org-super-agenda-mode 1))
#+end_src


Create the custom agenda command for super agenda
#+begin_src elisp
  (setq org-agenda-custom-commands
      '(("c" "Super agenda"
         ((agenda "" ((org-agenda-overriding-header "")
                      (org-super-agenda-groups
                       '((:log t)
                         (:name "Overdue"
                          :deadline past)
                         (:name "Habits"
                          :habit t)
                         (:name "Today"
                          :time-grid t
                          :date today)
                         (:name "Unstarted"
                          :scheduled past)
                         (:discard (:anything t))
                         ))))
          (alltodo "" ((org-agenda-overriding-header "")
                       (org-super-agenda-groups
                        `((:log t)
  			
                         (:name "Important"
                          :priority "A"
                          :face (:weight ultra-bold :background "blue")
                          :order 2)
                          (:name "Next"
                           :todo "NEXT"
                           :order 4)
                         (:name "Coming up"
                                :scheduled future
                                :order 5)
                          (:name "In progress"
                           :todo "PROG"
                           :order 3)
                          (:name "Can wait"
                           :priority "C"
                           :order 6)
                          (:name "If time"
                           :priority "B"
                           :order 5)
  			(:name "Jira -- other"
  			       :file-path ,(expand-file-name "~/.org-jira"))
                          (:name "Blocked"
                                 :todo "HOLD"
                                 :order 100)
                          (:discard (:file-path ,(expand-file-name "~/org/habits.org")))
                          (:discard (:anything t))))))))))
#+end_src

#+RESULTS:
| c | Super agenda | ((agenda  ((org-agenda-overriding-header ) (org-super-agenda-groups '((:log t) (:name Overdue :deadline past) (:name Habits :habit t) (:name Today :time-grid t :date today) (:name Unstarted :scheduled past) (:discard (:anything t)))))) (alltodo  ((org-agenda-overriding-header ) (org-super-agenda-groups `((:log t) (:name Important :priority A :face (:weight ultra-bold :background blue) :order 2) (:name Next :todo NEXT :order 4) (:name Coming up :scheduled future :order 5) (:name In progress :todo PROG :order 3) (:name Can wait :priority C :order 6) (:name If time :priority B :order 5) (:name Jira -- other :file-path ,(expand-file-name ~/.org-jira)) (:name Blocked :todo HOLD :order 100) (:discard (:file-path ,(expand-file-name ~/org/habits.org))) (:discard (:anything t))))))) |


** Templates
#+begin_src elisp
    (setq org-capture-templates '(("a" "Agenda")
                                ("at" "TODO" entry
                                 (file "~/org/agenda.org")
                                 "* TODO %?"
                                 :empty-lines-before 1)
                                  ("ad" "Deadline" entry
                                   (file+olp+datetree "~/org/agenda.org")
                                   "* %?\nDEADLINE: %^{at}t")
                                  ("t" "Todos")
                                  ("tt" "project todo" entry
                                   (file "~/org/projects.org")
                                   "* TODO %?\n%i"
                                 :empty-lines-before 1)
                                  ("tf" "file todo" entry
                                   (file "~/org/projects.org")
                                   "* TODO %?\n%a"
                               :empty-lines-before 1)
                                  ("tn" "today" entry
                                   (file+headline "~/org/todo.org" "Todos")
                                   "* TODO %?\n%t"
                                 :empty-lines-before 1)
                                  ("td" "deadline" entry
                                   (file+headline "~/org/todo.org" "Todos")
                                   "* TODO %?\nDEADLINE: %^{at}t"
                               :empty-lines-before 1)
                                  ("ts" "scheduled" entry
                                   (file+headline "~/org/todo.org" "Todos")
                                   "* TODO %?\nSCHEDULED: %^{at}t"
                                 :empty-lines-before 1)
                                  ("c" "chore" entry
                                   (file +org-chores-file)
                                   "* TODO %?\nDEADLINE: %t"
                               :empty-lines-before 1)
                                  ("n" "notes")
                                  ("nd" "discussion" entry
                                   (file+datetree "~/org/discussions.org")
                                   "* %?"
                                   :tree-type month)
    			      ("nf" "file note" entry
    			       (file "~/org/notes.org")
    			       "* %?\n%a"
  			       :empty-lines-after 1)
                                  ("d" "developer log" entry
                                   (file+datetree "~/org/dev_log.org")
                                   "* %?\n** Worked on\n\n** Went well\n\n** Room for improvement"
                                   :empty-lines-after 1)))

#+end_src

#+RESULTS:
| a  | Agenda   |       |                                      |           |                     |   |
| at | TODO     | entry | (file ~/org/agenda.org)              | * TODO %? | :empty-lines-before | 1 |
| ad | Deadline | entry | (file+olp+datetree ~/org/agenda.org) | * %?      |                     |   |


